ДипломДоп/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ХранилищеФайлов</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлЗначение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФайлПуть</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДипломДоп/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПрисоеденитьФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.МножественныйВыбор = Ложь;
    Если Диалог.Выбрать() Тогда
        ПутьКФайлу = Диалог.ПолноеИмяФайла;
        ПозицияПоследнейТочкиВПолномИмениФайла = СтрНайти(ПутьКФайлу, ".", НаправлениеПоиска.СКонца,,1);
        ПозицияПоследнегоСловаСлева = СтрНайти(ПутьКФайлу,"\", НаправлениеПоиска.СКонца,,1);
        Расширение = Прав(ПутьКФайлу,СтрДлина(ПутьКФайлу) - ПозицияПоследнейТочкиВПолномИмениФайла);
        ФайлИмя = Сред(ПутьКФайлу, ПозицияПоследнегоСловаСлева + 1, ПозицияПоследнейТочкиВПолномИмениФайла - ПозицияПоследнегоСловаСлева - 1);    
    КонецЕсли; 
    
    Если Не ПутьКФайлу = "" Тогда
        ПрисоеденитьФайлНаСервере();
        Элементы.ВыполненныеРаботыПосмотретьФайл.Доступность = Истина;
    Иначе
        Сообщить("Файл не выбран");
    КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПрисоеденитьФайлНаСервере()
	
	  ДокументОбъект = РеквизитФормыВЗначение("Объект"); 	  
	  КоличествоСтрок = ДокументОбъект.ХранилищеФайлов.Количество();      
	  ДокументОбъект.ХранилищеФайлов.Добавить();
	  ДокументОбъект.ХранилищеФайлов[КоличествоСтрок].ФайлПуть = ПутьКФайлу;
	  ДокументОбъект.ХранилищеФайлов[КоличествоСтрок].ИмяФайла = ФайлИмя;
	  ДокументОбъект.ХранилищеФайлов[КоличествоСтрок].ФайлЗначение = Расширение;
	  ДокументОбъект.Записать();
	  ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
	  
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьФайл(Команда)
		
	НомерТекущейСтроки = Элементы.ХранилищеФайлов.ТекущиеДанные.НомерСтроки;
	ПосмотретьФайлНаСервере(НомерТекущейСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПосмотретьФайлНаСервере(НомерСтроки)
	
   ДокументОбъект = РеквизитФормыВЗначение("Объект");   
   Путь = ДокументОбъект.ХранилищеФайлов[НомерСтроки-1].ФайлПуть;  
   ЗапуститьПриложение(Путь);
   ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");
    
КонецПроцедуры
